app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params.merge(user_id: current_user.id))
---
INSERT INTO "posts" ("message", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "wasps are shit"], ["created_at", "2019-11-10 20:45:15.965082"], ["updated_at", "2019-11-10 20:45:15.965082"], ["user_id", 7]]